app/Controllers/Client.php

SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 1
---
    public function solde()
    {
        $compteModel = new CompteModel();
        $compte      = $compteModel->find(session()->get('compte_id'));

        $data = [
            'numero_telephone' => session()->get('numero_telephone'),
            'solde'            => $compte['solde'] ?? 0,
        ];

SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 1
UPDATE `comptes` SET `solde` = 52000
WHERE `comptes`.`id` IN (1)
INSERT INTO `operations` (`compte_id`, `type_operation_id`, `montant`, `frais`) VALUES (1, 1, 2000, 0)
---
    public function deposer()
    {
        $rules = [
            'montant' => [
                'label' => 'Montant',
                'rules' => 'required|numeric|greater_than[0]',
                'errors' => [
                    'required'      => 'Veuillez saisir un montant.',
                    'numeric'       => 'Le montant doit être un nombre.',
                    'greater_than'  => 'Le montant doit être supérieur à 0.',
                ],
            ],
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('erreurs', $this->validator->getErrors());
        }

        $montant  = (float) $this->request->getPost('montant');
        $compteId = (int) session()->get('compte_id');

        $typeOperationModel = new TypeOperationModel();
        $typeDepot          = $typeOperationModel->trouverParCode('depot');

        $compteModel    = new CompteModel();
        $operationModel = new OperationModel();

        $db = db_connect();
        $db->transStart();

        $compte = $compteModel->find($compteId);
        $compteModel->update($compteId, [
            'solde' => $compte['solde'] + $montant,
        ]);

        $operationModel->insert([
            'compte_id'         => $compteId,
            'type_operation_id' => $typeDepot['id'],
            'montant'           => $montant,
            'frais'             => 0,
        ]);

SELECT *
FROM `comptes`
WHERE `comptes`.`id` = 1
---
        $total = $montant + $frais;

        $compteModel = new CompteModel();
        $compte      = $compteModel->find($compteId);

UPDATE `comptes` SET `solde` = 49750
WHERE `comptes`.`id` IN (1)
INSERT INTO `operations` (`compte_id`, `type_operation_id`, `montant`, `frais`) VALUES (1, 2, 400, 50)
---
        $db = db_connect();
        $db->transStart();

        $compteModel->update($compteId, [
            'solde' => $compte['solde'] - $total,
        ]);

        $operationModel->insert([
            'compte_id'         => $compteId,
            'type_operation_id' => $typeRetrait['id'],
            'montant'           => $montant,
            'frais'             => $frais,
        ]);