app/Models/ClientModel.php

    public function listeAvecSolde(?string $recherche = null): array
    {
        $builder = $this->db->table('clients c')
            ->select('c.id, c.numero_telephone, c.date_creation, ' .
                'COALESCE(cpt.solde, 0) AS solde')
            ->join('comptes cpt', 'cpt.client_id = c.id', 'left')
            ->orderBy('c.numero_telephone', 'ASC');

        if ($recherche !== null && $recherche !== '') {
            $builder->like('c.numero_telephone', $recherche);
        }

        return $builder->get()->getResultArray();
---
SELECT *
FROM `clients`
WHERE `numero_telephone` = '0371122334'
 LIMIT 1