app/Models/CompteModel.php

SELECT *
FROM `comptes`
WHERE `client_id` = 3
 LIMIT 1
---
    public function trouverParClient(int $clientId): ?array
    {
        return $this->where('client_id', $clientId)->first();