app/Models/OperationModel.php

SELECT `o`.`id`, `o`.`montant`, `o`.`frais`, `o`.`date_operation`, `o`.`compte_id`, `o`.`compte_destinataire_id`, `t`.`code` AS `type_code`, `t`.`libelle` AS `type_libelle`, `ce`.`numero_telephone` AS `numero_expediteur`, `cd`.`numero_telephone` AS `numero_destinataire`
FROM `operations` `o`
JOIN `types_operation` `t` ON `t`.`id` = `o`.`type_operation_id`
JOIN `comptes` `co_exp` ON `co_exp`.`id` = `o`.`compte_id`
JOIN `clients` `ce` ON `ce`.`id` = `co_exp`.`client_id`
LEFT JOIN `comptes` `co_dest` ON `co_dest`.`id` = `o`.`compte_destinataire_id`
LEFT JOIN `clients` `cd` ON `cd`.`id` = `co_dest`.`client_id`
WHERE   (
`o`.`compte_id` = 1
OR `o`.`compte_destinataire_id` = 1
 )
ORDER BY `o`.`date_operation` DESC
---
    public function historiqueDuCompte(int $compteId): array
    {
        return $this->db->table('operations o')
            ->select('o.id, o.montant, o.frais, o.date_operation, '
                . 'o.compte_id, o.compte_destinataire_id, '
                . 't.code AS type_code, t.libelle AS type_libelle, '
                . 'ce.numero_telephone AS numero_expediteur, '
                . 'cd.numero_telephone AS numero_destinataire')
            ->join('types_operation t', 't.id = o.type_operation_id')
            ->join('comptes co_exp', 'co_exp.id = o.compte_id')
            ->join('clients ce', 'ce.id = co_exp.client_id')
            ->join('comptes co_dest', 'co_dest.id = o.compte_destinataire_id', 'left')
            ->join('clients cd', 'cd.id = co_dest.client_id', 'left')
            ->groupStart()
                ->where('o.compte_id', $compteId)
                ->orWhere('o.compte_destinataire_id', $compteId)
            ->groupEnd()
            ->orderBy('o.date_operation', 'DESC')
            ->get()
            ->getResultArray();